const tafseer = [
    {
        id: 0,
        source: 'https://quranpedia.net/',
        content: 'بسم الله الرحمن الرحيم مسألة: إذا كان المراد بالبسملة الاستعانة به تعالى، فما فائدة إقحام الاسم بين الباء وبين لفظة الجلالة مع أن الاستعانة به لا بنفس الاسم (1) ؟ . جوابه: أن القصد به التعظيم والإجلال لذاته تعالى، ومنه: ﴿سبح اسم ربك الأعلى ﴾ و ﴿تبارك اسم ربك﴾ . لم اختصت البسملة بهذه الأسماء الثلاثة؟ أما الأول: فلأنه اسم المعبود المستحق للعبادة دون غيره، والموجد لعباده. والثاني والثالث: تنبيه على المقتضى لسؤال الاستعانة به، وهو سعة رحمته لعباده. ________ (1) معنى الحال: لماذا قيل: باسم الله، ولم يقل بالله وهو أصل التعبير لأن الاستعانة بالله لا بالاسم.'
    },
    {
        id: 1,
        source: 'https://quranpedia.net/',
        content: 'قوله ﴿وإذ قال ربك للملائكة إني خالق بشرا﴾. هنا وفي ص 71 وفي البقرة ﴿وإذ قال ربك للملائكة إني جاعل﴾ ولا ثالث لهما لأن جعل إذا كان بمعنى خلق يستعمل في الشيء يتجدد ويتكرر كقوله ﴿خلق السماوات والأرض وجعل الظلمات والنور﴾ لأنهما يتجددان زمانا بعد زمان وكذلك الخليفة يدل لفظه على أن بعضهم يخلف بعضا إلى يوم القيامة وخصت هذه السورة بقوله ﴿إني خالق بشرا﴾ إذ ليس في لفظ البشر ما يدل على التجدد والتكرار فجاء في كل واحدة من السورتين ما اقتضاه ما بعده من الألفاظ.'
    },
    {
        id: 2,
        source: 'https://quranpedia.net/',
        content: 'مسألة: (صراط الذين أنعمت عليهم؟ جوابه: تصريح بإضافة النعم إليه دون الغضب، فلذلك لم يقل: غير الذين غضبت عليهم كما قال أنعمت عليهم، وهو من باب الأدب من السائل في حال السؤال ومنه: ببيدك الخير ولم يقل والشر، ونبه على ضده بقوله: إنك على كل شىيء قدير'
    },
    {
        id: 3,
        source: 'https://quranpedia.net/',
        content: 'قوله تعالى: (لمن تاب وآمن وعمل صالحا ثم اهتدى (82) وقال تعالى: (والذين اهتدوا زادهم هدى وآتاهم تقواهم (17)) فالاهتداء هنا مؤخر عن الإيمان والعمل الصالح وفى الآية الأخرى مقدم عليها؟ جوابه: أن المراد بقوله: ﴿ثم اهتدى﴾ أي دام على هدايته، كقوله تعالى: (اهدنا الصراط المستقيم (6) أي ثبتنا عليه وأدمنا.'
    },
    {
        id: 4,
        source: 'https://quranpedia.net/',
        content: 'كرر لفظ ﴿الصراط﴾ ثانيا؟ جوابه( 2) : لبيان وصف سالكيه المنعم عليهم. فالأول: وصفه بالاستقامة. والثاني: بوصف سالكيه من السفرة والصديقين. ولما كان الطريق تقتضي الرفيق نبه تعالى عليه بقوله تعالى: ﴿وحسن أولئك رفيقا﴾.'
    },
    {
        id: 5,
        source: 'https://quranpedia.net/',
        content: 'مسألة: إياك نعبد وإياك نستعين؟ جوابه ( 11) : كررت إياك المفيدة للحصر إذا تقدمت: للتصريح بتوكيد حصر الإخلاص في العبادة له، وحصر الاستعانة أيضا به تعالى.'
    },
    {
        id: 6,
        source: 'https://quranpedia.net/',
        content: 'قوله تعالى ﴿إياك نعبد وإياك نستعين﴾ كرر ﴿إياك﴾ وقدمه ولم يقتصر على ذكره مرة كما اقتصر على ذكر أحد المفعولين في آيات كثيرة منها ﴿ما ودعك ربك وما قلى﴾ أي ما قلاك وكذلك الآيات التي بعدها معناها فآواك فهداك فأغناك لأن في التقديم فائدة وهي قطع الاشتراك ولو حذف لم يدل على التقديم لأنك لو قلت إياك نعبد ونستعين لم يظهر أن التقدير إياك نعبد وإياك نستعين أم إياك نعبد ونستعينك فكرر.'
    },
    {
        id: 7,
        source: 'https://quranpedia.net/',
        content: 'مسألة: ما فائدة العدول من الغيبة إلى الخطاب - ص 28 - في قوله تعالى: وإياك نعبد*؟ جوابه: أن الخطاب للحاضر، والاستعانة به أقرب إلى حصول المطلوب من خطاب الغائب والله أعلم.'
    },
    {
        id: 8,
        source: 'https://quranpedia.net/',
        content: 'أول المتشابهات قوله {الرحمن الرحيم مالك} فيمن جعل ﴿بسم الله الرحمن الرحيم﴾ آية من الفاتحة وفي تكراره قولان قال علي بن عيسى إنما كرر للتوكيد وأنشد قول الشاعر : ... هلا سألت جموع كندة يوم ولوا أين أينا ... وقال قاسم بن حبيب إنما كرر لأن المعنى وجب الحمد لله لأنه الرحمن الرحيم قلت إنما كرر لأن الرحمة هي الإنعام على المحتاج وذكر في الآية الأولى المنعم ولم يذكر المنعم عليهم فأعادها مع ذكرهم وقال {رب العالمين الرحمن} لهم جميعا ينعم عليهم ويرزقهم ﴿الرحيم﴾ بالمؤمنين خاصة يوم الدين ينعم عليهم ويغفر لهم .'
    },
    {
        id: 9,
        source: 'https://quranpedia.net/',
        content: 'مسألة: فما فائدة إعادتها ثانيا بعد الحمد؟ جوابه: التنبيه على الصفات المقتضية لحمده وشكره وهي: سعة رحمته تعالى لعباده، ولطفه، ورزقه، وأنواع نعمه. فالأول: توكيد الاستعانة، والثاني: توكيد الشكر. وهذه الآية جمعت ما لم يجتمع في آية غيرها، وهو: أنها آية مستقلة في الفاتحة عند من قال به. وهي بعض آية في النمل. وربعها الأول بعض آية في: (اقرأ باسم ربك. ونصفها الأول بعض آية في هود: (بسم الله مجراها. وربعها الثاني بعض آية فى الرحمن: (الرحمن (1) علم القرآن) ونصفها الثانى آية فى الفاتحة، وبعض آية فى سورة البقرة هو: ﴿الرحمن الرحيم﴾'
    },
    {
        id: 10,
        source: 'https://quranpedia.net/',
        content: 'مسألة: قوله تعالى: ﴿قل أرأيتم إن كان من عند الله ثم كفرتم به﴾ وفى الأحقاف: ﴿وكفرتم به﴾ ؟ جوابه: أنه يجوز أن يكون ﴿ثم﴾ هنا للاستبعاد من الكفر مع العلم بكونه من عند الله فإن التخلف عن الإيمان بعد ظهور كونه من عند الله مستبعد عند العقلاء، ولذلك قال تعالى: من أضل ممن هو في شقاق بعيد) ، وهو كقوله تعالى: ﴿ثم أنتم تمترون﴾ و "الواو" في الأحقاف واو العطف بمعنى الجمع، وجواب الشرط مقدر تقديره: إن اجتمع كونه من عند الله وكفرتم به وشهادة الشاهد وإيمانه ألستم بكفركم ظلمة ودل عليه أن الله لا يهدى القوم الظالمين.'
    },
]